Repository: rtobar/imanes
Catalog: po/*.po
Languages: es

source: Performing switch to bank %d of VROM
es: Realizando cambio al banco %d de la VROM

source: %s: Still unimplemented
es: %s: Todavía sin implementar

source: PPU: Write to PPU[%d]=$%02X PC=%04X
es: PPU: Escritura en PPU[%d]=$%02X PC=%04X

source: CPU Address mirroring: from %04x to
es: Mirroring de dirección de CPU desde %04x a

source: Write to %04x not allowed
es: Escritura en %04x no permitida

source: Returning %02x from %04x
es: Retornando %02x desde %04x

source: Executing NMI!
es: ¡Ejecutando NMI!

source: Quiting ImaNES
es: Saliendo de ImaNES

source: Couldn't refresh screen :(
es: No se pudo actualizar la pantalla :(

source: I'm exiting now
es: Ahora estoy saliendo

source: Couldn't find user's configuration
es: No se pudo encontrar la configuración del usuario

source: Error while opening configuration file '%s':
es: Error al abrir el archivo de configuración '%s':

source: No configuration will be loaded from configuration file
es: No se cargará ninguna configuración desde el archivo de configuración

source: Directory '%s' not found, creating it...
es: No se encontró el directorio '%s', creándolo...

source: Error while creating directory '%s':
es: Error al crear el directorio '%s':

source: Couldn't find user's home directory. Will not load user configuration
es: No se pudo encontrar el directorio del usuario.No se cargará la configuración de usuario

source: Hey!!! You haven't written the %d addressing mode!!!
es: ¡Hey! ¡No has escrito el modo de direccionamiento %d!

source: Ending VBlank
es: Finalizando VBlank

source: Undocumented instruction: %02X
es: Instrucción no documentada: %02X

source: I'm exiting now... sorry :(
es: Ahora estoy saliendo... perdón :(

source: Close the window when finished
es: Cierra la ventana cuando termines

source: %s: I'm a NES
es: %s: I'm a NES (Soy un NES)

source: This program is licensed under the GPLv3 license.
es: Este programa está licenciado bajo la licencia GPLv3.

source: For bug reports, please refer to %s
es: Para reporte de fallos, por favor diríjase a %s

source: Usage: %s [options] <rom file>
es: Uso: %s [opciones] <archivo rom>

source: Options:
es: Opciones:

source: -v Increase verbosity. More -v, more verbose. Default: 0
es: -v Incrementa la verbosidad. Más -v, mÃ¡s verboso. Por defecto: 0

source: -s <n> Video scaling factor. Default: 1
es: -s <n> Factor de escalamiento del video. Por defecto: 1

source: -c Use SDL color construction. Default: no
es: -c Usar construcción de colores de SDL. Por defecto: no

source: -m Mute sound. Default: no
es: -m Deshabilitar el sonido. Por defecto: no

source: -h,-? Show this help and exit
es: -h,-? Muestra esta ayuda y finaliza

source: -V Show the current version of ImaNES and exit
es: -V Muestra la versión actual de ImaNES y finaliza

source: ImaNES development is maintained by Rodrigo Tobar <rtobar@csrg.inf.utfsm.cl>
es: El desarrollo de ImaNES es mantenido por Rodrigo Tobar <rtobar@csrg.inf.utfsm.cl>

source: Please refer to the AUTHORS file for more details
es: Por favor refiérase al archivo AUTHORS para más detalles

source: %s version %s
es: %s versión %s

source: The current version of %s was compiled on %s, %s
es: La versión actual de %s fue compilada el %s, %s

source: Error: invalid video scale factor. Must be an integer value
es: Error: Factor de escalamiento de video inválido. Debe ser un valor entero

source: %s: Error: Expected ROM file, none given
es: %s: Error: Se esperaba un archivo ROM, no se indicó ninguno

source: <no registers>
es: <ningún registro>

source: MMC1: reg0: Changed from %02x to %02x
es: MMC1: reg0: Cambiado de %02x a %02x

source: MMC1: reg1: Changed from %02x to %02x
es: MMC1: reg1: Cambiado de %02x a %02x

source: MMC1: reg2: Changed from %02x to %02x
es: MMC1: reg2: Cambiado de %02x a %02x

source: MMC1: reg3: Changed from %02x to %02x
es: MMC1: reg3: Cambiado de %02x a %02x

source: MMC1: Switching 8 Kb VROM bank %d. Offset is
es: MMC1: Cambiando el banco VROM %d de 8 Kb. El corrimiento es

source: MMC1: Switching 4 Kb VROM banks %d/%d. Offsets are
es: MMC1: Cambiando los bancos VROM %d/%d de 4 Kb. Los corrimientos son

source: MMC1: Switching 32 Kb ROM bank %d and offset %04x to 0x8000
es: MMC1: Cambiando el banco VROM %d de 32 Kb y corrimiento %04x a 0x8000

source: MMC1: Switching 16 Kb ROM bank %d and offset %04x to %04x
es: MMC1: Cambiando el banco VROM %d de 16 Kb y corrimiento %04x a %04x

source: Change of PRG mode: %u
es: Cambio de modo PRG: %u

source: Change of CHR mode: %u
es: Cambio de modo CHR: %u

source: changed!
es: ¡cambiado!

source: Enabling
es: Activando

source: Disabling
es: Desactivando

source: SRAM switching to %s mode
es: Cambiando la SRAM a modo %s

source: MMC3: Writting %02x to 0xC000
es: MMC3: Escribiendo %02x en 0xC000

source: MMC3: Resetting counter to 0
es: MMC3: Reiniciando el contador en 0

source: Error, execution shouldn't have reached this point
es: Error, la ejecución no debería alcanzar este punto

source: MMC3: Triggering IRQ caused by 0 writing to 0xC000
es: MMC3: Gatillando IRQ provocado por 0 escribiendo en 0xC000

source: MMC3: Setting irq_counter to %u
es: MMC3: Poniendo irq_counter en %u

source: MMC3: Decrementing irq_counter. New value: %u
es: MMC3: Disminuyendo irq_counter. Nuevo valor: %u

source: MMC3: Triggering IRQ
es: MMC3: Gatillando IRQ

source: Copying VROM to VRAM
es: Copiando la VROM a la VRAM

source: Pad %d. Pressed button:
es: Control %d. Botón apretado:

source: Screen background %s
es: Fondo de pantalla %s

source: Back sprites %s
es: Sprites de fondo %s

source: Background %s
es: Fondo %s

source: Front sprites %s
es: Sprites de primer plano %s

source: Square1 channel %s
es: Canal Cuadrado1 %s

source: Square2 channel %s
es: Canal Cuadrado2 %s

source: Triangle channel %s
es: Canal Triangular %s

source: Noise channel %s
es: Canal de Ruido %s

source: DMC channel %s
es: Canal DMC %s

source: Resetting NES
es: Reiniciando NES

source: Show frames per second %s
es: Mostrar frames por segundo %s

source: Instructions never executed:
es: Instrucciones sin ejecutar:

source: %s sound recording (not yet implemented)
es: %s la grabación de sonido (aún no implementado)

source: Stopping
es: Deteniendo

source: Starting
es: Empezando

source: %s emulation
es: %s emulación

source: Resuming
es: Reanudando

source: Pausing
es: Suspendiendo

source: No | Picture | Sprites
es: Num| Dibujo | Sprites

source: Error: %s is not a valid NES ROM, incompatible header information
es: Error: %s no es un ROM NES válido, información de cabecera incompatible

source: Error: %s is not a valid NES ROM
es: Error: %s no es un ROM NES válido

source: File contains %hu 16kb ROM banks and %hu 8kb VROM banks
es: El archivo contiene %hu bancos ROM de 16 Kb y %hu bancos VROM de 8 Kb

source: Mirroring type: %d
es: Tipo de mirroring: %d

source: SRAM is %s
es: La SRAM está %s

source: enabled
es: activada

source: disabled
es: desactivada

source: ROM mapper is '%s'
es: El mapper del ROm es '%s'

source: Sorry, but we currently support cartridges using the mapper %d
es: Disculpe, pero actualmente no soportamos cartuchos que usen el mapper %d

source: I'm exiting now.
es: Me voy yendo.

source: Trainer present in ROM file
es: Trainer presente en el archivo ROM

source: Error: malformed file (ROM not complete)
es: Error: archivo malformado (ROM incompleto)

source: Error: malformed file (VROM not complete)
es: Error: archivo malformado (VROM incompleto)

source: Warning: NES file contains more data than it should
es: Advertencia: el archivo NES contiene más datos de los que debería

source: [audio] Cannot initialize audio: %s
es: [audio] No se puede iniciar el audio: %s

source: [audio] Unsupported audio format: %d, no audio will be played
es: [audio] Formato de audio no soportado: %d, no se reproducirá audio

source: Set Hit flag at scanline %d
es: Hit flag seteada durante la línea de escaneo %d

source: PPU Address mirroring: from %04x to
es: Mirroring de dirección PPU: desde %04x a

source: Palette mirroring: from %04x to
es: Mirroring de paleta: desde %04x a

source: Error when initializing screen: %s
es: Error al iniciar la pantalla: %s

source: Could not load ImaNES icon :(
es: No se pudo cargar el ícono de ImaNES :(

source: Error while setting video mode: %s
es: Error al establecer el modo de video: %s

source: Couldn't save screenshot
es: No se pudo guardar la captura de pantalla

source: Error while opening '%s':
es: Error al abrir '%s':

source: Error while saving snapshot
es: Error al guardar el pantallazo

source: Saved screenshot at '%s'
es: Captura de pantalla guardada en '%s'

source: Saving SRAM...
es: Salvando la SRAM...

source: Couldn't dump SRAM data to '%s':
es: No se pudo volcar los datos de la SRAM a '%s':

source: done!
es: ¡listo!

source: Loading SRAM...
es: Cargando la SRAM...

source: Couldn't load SRAM because saves direcory cannot be accessed
es: No se pudo cargar la SRAM porque el directorio de guardado no se pudo acceder

source: SRAM disabled, not loading anything
es: SRAM deshabilitada, no se cargarÃ¡ nada

source: File '%s' is not a valid SRAM dump file, SRAM not loaded.
es: El archivo '%s' no es un archivo de SRAM válido, la SRAM no se cargó.

source: Cannot load state %d because it doesn't exist
es: No se pudo cargar el estado %d porque no existe

source: File '%s' is not a valid state file
es: El archivo '%s' no es un archivo de estado válido

source: Loaded state %d
es: Estado %d cargado

source: Couldn't save state: cannot reach states dir
es: No se pudo guardar el estado: no se pudo encontrar el directorio de estados

source: Error while saving state to file
es: Error al guardar archivo de estado

source: Saved state %d
es: Estado %d guardado

source: Performing bank switching: Switching to bank %d of ROM
es: Realizando cambio de banco: cambiando al banco %d del ROM
